//Arrey
//🎯 Действие			🛠️ Метод				🔍 Назначение									⬅️ Возвращаемый тип
// размер массива			arr.length			Возвращает фиксированный размер массива.		int
// Доступ по индексу		arr[index]			Доступ к элементу по индексу.					Тип элемента

//ArreyList:
//🎯 Действие			🛠️ Метод				🔍 Назначение									⬅️ Возвращаемый тип
// Добавить				add(Element)			Добавляет элемент в конец списка.				boolean (всегда true)
// Добавить по индексу	add(index, Element)		Вставляет элемент по указанному индексу.		void (ничего не возвращает)
// Получить				get(index)				Возвращает элемент по индексу.					Тип элемента (например, String)
// Изменить				set(index, Element)		Заменяет элемент по индексу новым.				Тип элемента (старое значение)
// Удалить				remove(index)			Удаляет элемент по индексу.						Тип элемента (удаленное значение)
// Размер				size()					Возвращает текущее кол-во элем. в списке.		int
// Проверить наличие	contains(Object)		Проверяет, содержит ли список объект.			boolean

// 	🧩 Символ			📜 Название					🧠 Значение (Граница)									🎯 Назначение
// 		<?>				Неограниченный Wildcard		Любой тип.													Для методов, которые только читают данные из списка (как твой printArrList).
// 		<? extends T>	Верхняя граница				T или любой подкласс T (например, Number, Integer, Double).	Для методов, которые только читают (извлекают) данные. Гарантирует, что данные являются хотя бы T.
// 		<? super T>		Нижняя граница				T или любой суперкласс T (например, Object).				Для методов, которые только пишут (добавляют) данные. Гарантирует, что список может принять T.
package oldPractice;
import java.util.ArrayList; // ВАЖНО ПЕРЕНЕСТИ!!!!


public class ArrDemo {
	public static void main(String[] args) {
		// Создаем динамический список, хранящий объекты Integer
		ArrayList <Integer> integerList = new ArrayList<>();// ВАЖНО ПЕРЕНЕСТИ!!!!

		String[] arr = new String[5]; //правильное обьявление масива

		integerList.add(95); // Добавить элемент
		integerList.add(88);

		System.out.println("Первый элемент: " + integerList.get(1));

		ArrayList <String> neuStringList = new ArrayList<>();// ВАЖНО ПЕРЕНЕСТИ!!!!
		neuStringList.add("Oleg");
		neuStringList.add("Alex");
		printArrList(neuStringList);
		
		
	}


	public static void printArrList (ArrayList<?> newArrayList){

	// Улучшенный цикл c использованием .length


	for (int i = 0; i < newArrayList.size(); i++) {

		System.out.println("Переменная numbers #" + i + " = " + newArrayList.get(i));
		slowFunc (150);
	}
	System.out.println("...Готово!");

	}

	public static void slowFunc (int delayMilliseconds){
		try {
			Thread.sleep(delayMilliseconds);
		}
		catch (InterruptedException e) {
			// B учебных целях, мы можем проигнорировать
		}
	}
}


